In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

In [2]:
df1=pd.read_csv('../data/item_properties_part1.csv')
df2=pd.read_csv('../data/item_properties_part2.csv')

In [3]:
df1

              timestamp  itemid    property                            value
0         1435460400000  460429  categoryid                             1338
1         1441508400000  206783         888          1116713 960601 n277.200
2         1439089200000  395014         400  n552.000 639502 n720.000 424566
3         1431226800000   59481         790                       n15360.000
4         1431831600000  156781         917                           828513
...                 ...     ...         ...                              ...
10999994  1439694000000   86599  categoryid                              618
10999995  1435460400000  153032        1066                 n1020.000 424566
10999996  1440298800000  421788         888               35975 856003 37346
10999997  1437879600000  159792         400  n552.000 639502 n720.000 424566
10999998  1436065200000  464846         790                      n410640.000

[10999999 rows x 4 columns]

In [4]:
df2

             timestamp  itemid property                             value
0        1433041200000  183478      561                            769062
1        1439694000000  132256      976                   n26.400 1135780
2        1435460400000  420307      921                   1149317 1257525
3        1431831600000  403324      917                           1204143
4        1435460400000  230701      521                            769062
...                ...     ...      ...                               ...
9275898  1433646000000  236931      929                           n12.000
9275899  1440903600000  455746        6                     150169 639134
9275900  1439694000000  347565      686                            610834
9275901  1433646000000  287231      867                            769062
9275902  1442113200000  275768      888  888666 n10800.000 746840 1318567

[9275903 rows x 4 columns]

In [6]:
df=pd.concat([df1,df2],ignore_index=True)

In [7]:
df

              timestamp  itemid    property                             value
0         1435460400000  460429  categoryid                              1338
1         1441508400000  206783         888           1116713 960601 n277.200
2         1439089200000  395014         400   n552.000 639502 n720.000 424566
3         1431226800000   59481         790                        n15360.000
4         1431831600000  156781         917                            828513
...                 ...     ...         ...                               ...
20275897  1433646000000  236931         929                           n12.000
20275898  1440903600000  455746           6                     150169 639134
20275899  1439694000000  347565         686                            610834
20275900  1433646000000  287231         867                            769062
20275901  1442113200000  275768         888  888666 n10800.000 746840 1318567

[20275902 rows x 4 columns]

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20275902 entries, 0 to 20275901
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   timestamp  int64
 1   itemid     int64
 2   property   object
 3   value      object
dtypes: int64(2), object(2)
memory usage: 618.8+ MB

In [9]:
df['timestamp']=pd.to_datetime(df['timestamp'],unit='ms')

In [10]:
categories = df[df["property"] == "categoryid"]

In [11]:
categories

                   timestamp  itemid    property value
0        2015-06-28 03:00:00  460429  categoryid  1338
140      2015-05-24 03:00:00  281245  categoryid  1277
151      2015-06-28 03:00:00   35575  categoryid  1059
189      2015-07-19 03:00:00    8313  categoryid  1147
197      2015-07-26 03:00:00   55102  categoryid    47
...                      ...     ...         ...   ...
20275797 2015-06-07 03:00:00  255696  categoryid  1404
20275822 2015-05-10 03:00:00  390760  categoryid   324
20275830 2015-07-26 03:00:00  211844  categoryid   256
20275872 2015-06-28 03:00:00  444741  categoryid   511
20275878 2015-06-28 03:00:00   97513  categoryid  1385

[788214 rows x 4 columns]

In [12]:
categories = categories[["itemid", "value"]].rename(
    columns={"value": "category_id"}
)
categories.head()

     itemid category_id
0    460429        1338
140  281245        1277
151   35575        1059
189    8313        1147
197   55102          47